newwms_gift/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияМест</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>итПреоритетнаяЗонаРазмещения</name>
    <type>
      <types>CatalogRef.итСкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>итИдентификаторНоменклатурнойПозиции</name>
    <type>
      <types>CatalogRef.итИндентификаторыТоварныхПозиций</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
</mdclass:Catalog>

newwms_gift/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <comment>(Общ)</comment>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>CatalogRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЗаполнитьТаблицуШк();
КонецПроцедуры

&НаКлиенте
Процедура ШтрихКодыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Для добавление шк, необходимо записать объект");
		Отказ=Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуШк()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод,
		|	Штрихкоды.Владелец,
		|	Штрихкоды.ТипШтрихкода,
		|	Штрихкоды.ЕдиницаИзмерения,
		|	Штрихкоды.ХарактеристикаНоменклатуры,
		|	Штрихкоды.СерияНоменклатуры,
		|	Штрихкоды.Качество
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ШтрихКоды.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НоваяСтрока=ШтрихКоды.Добавить();
	НоваяСтрока.ШтрихКод=ВыборкаДетальныеЗаписи.Штрихкод;
	НоваяСтрока.ТипШтрихКода=ВыборкаДетальныеЗаписи.ТипШтрихкода;
	НоваяСтрока.ЕдИзм=ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихКодыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Оповещение=новый ОписаниеОповещения("ЗаписатьШкВРегистр",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Записать изменения?",РежимДиалогаВопрос.ДаНет );
КонецПроцедуры

&НаКлиенте
Процедура ШтрихКодыПослеУдаления(Элемент)
	Оповещение=новый ОписаниеОповещения("ЗаписатьШкВРегистр",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Записать изменения?",РежимДиалогаВопрос.ДаНет );
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьШкВРегистр(Результат,Параметры) Экспорт
	Если Результат=КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьВРегистрСведенийШк();
	ЗаполнитьТаблицуШк();
КонецПроцедуры
&НаСервере
Процедура ЗаписатьВРегистрСведенийШк()
НаборЗаписей=РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.Владелец.Установить(объект.Ссылка);
НаборЗаписей.Прочитать();
НаборЗаписей.Очистить();
НаборЗаписей.Записать();
Для Каждого стр Из ШтрихКоды Цикл
НоваяСтрока=НаборЗаписей.Добавить();	
НоваяСтрока.Владелец=объект.Ссылка;
НоваяСтрока.ЕдиницаИзмерения=стр.ЕдИзм;
НоваяСтрока.Штрихкод=стр.ШтрихКод;
НоваяСтрока.ТипШтрихкода=стр.ТипШтрихКода;
КонецЦикла;
НаборЗаписей.Записать();	
КонецПроцедуры
